/*
 Напишите приложение, которое позволяет пользователю управлять своим списком контактов. 
 Используйте наследование, полиморфизм, принципы SOLID.

Контрагент — это либо человек, либо компания.

У каждого контрагента есть список способов связаться: телефон, email, ник в telegram, адрес страницы VK, уличный адрес. 
Разрешается, что у одного контрагента сколько угодно способов связаться, например, несколько телефонов или несколько адресов.

Программа должна позволять следующие действия:

• Посмотреть список контрагентов
• Найти контрагента по названию. Посмотреть подробную информацию о нём
• Добавить контрагента
• Удалить контрагента
• Добавить новый способ связаться с контрагентом
• Удалить способ связаться с контрагентом

Если задача кажется слишком простой, вы можете выбрать следующие необязательные усложнения:

• Используйте паттерн MVC или MVP для архитектуры приложения
• Решите задачу на языке, отличном от Java
• Возможность сохранять книгу контактов в файл, загружать из файла
*/

package home_work_13_OOP_06_FINAL_PROJECT;

import home_work_13_OOP_06_FINAL_PROJECT.modal.Contact;

public class Main {
    public static void main(String[] args) {
        // проба Contact cont1 = new Contact(null, null, null, null, null, null);
    }
}
