/*Задание №4
Каталог товаров книжного магазина сохранен в виде двумерного списка List<ArrayList<String>> так, что на 0-й позиции каждого внутреннего списка содержится название жанра, а на остальных позициях - названия книг. Напишите метод для заполнения данной структуры.
  проза          поэзия       док
Война и мир Бородино ……
12 стульев      ,,,,,              ……
*/

package sem_03;

import java.util.ArrayList;

public class sem03_4_ {
    // List<ArrayList<String>> это массив массивов строк. Двумерный массив. Эррэй лист эррэй листов ))
    public static void main(String[] args) {
    


    }
    
}
