/*Создайте интерфейс IsGood<T>. Внутри него содержится единственная функция:
boolean isGood (T item);

Создайте следующие детские классы:
- IsEven — ему дают целое число, он одобряет его, если оно чётное
- IsPositive — ему дают целое число, он одобряет его, если оно положительное
- BeginsWithA — ему дают строку, он одобряет её, если она начинается с буквы A
- BeginsWith — в конструкторе запоминает строку. Ему дают строку, он проверяет, что она начинается с того, что он запомнил

Создайте обобщённую функцию filter. Ей дают любую коллекцию любого типа, и одобрятель IsGood. 
Функция возвращает новую коллекцию, куда входят только одобренные элементы из коллекции.
*/
/*
 * <T>   Iterable<T>  filter (Iterable<T> array, IsGood<T> isGood)
 * мож.быть List или          наша коллекция    , одобритель
 *     Collection              упрощена до 
 *                              Iterable (типа мне не важно, какая коллекция, является родителем для всех коллекций), поддерживает foreach
*/

package home_work_10_OOP_04_NO;

public class Main {
    
}
